#  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣦⣴⣶⣾⣿⣶⣶⣶⣶⣦⣤⣄⠀⠀⠀⠀⠀⠀⠀
#  ⠀⠀⠀⠀⠀⠀⠀⢠⡶⠻⠛⠟⠋⠉⠀⠈⠤⠴⠶⠶⢾⣿⣿⣿⣷⣦⠄⠀⠀⠀                𓐓  array.py 𓐔           
#  ⠀⠀⠀⠀⠀⢀⠔⠋⠀⠀⠤⠒⠒⢲⠀⠀⠀⢀⣠⣤⣤⣬⣽⣿⣿⣿⣷⣄⠀⠀
#  ⠀⠀⠀⣀⣎⢤⣶⣾⠅⠀⠀⢀⡤⠏⠀⠀⠀⠠⣄⣈⡙⠻⢿⣿⣿⣿⣿⣿⣦⠀       Dev: oezzaou </var/spool/mail/oezzaou>
#  ⢀⠔⠉⠀⠊⠿⠿⣿⠂⠠⠢⣤⠤⣤⣼⣿⣶⣶⣤⣝⣻⣷⣦⣍⡻⣿⣿⣿⣿⡀
#  ⢾⣾⣆⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠉⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇
#  ⠀⠈⢋⢹⠋⠉⠙⢦⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇       Created: 2025/06/18 19:40:00 by oezzaou
#  ⠀⠀⠀⠑⠀⠀⠀⠈⡇⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇       Updated: 2025/06/19 16:47:20 by oezzaou
#  ⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⢀⣾⣿⣿⠿⠟⠛⠋⠛⢿⣿⣿⠻⣿⣿⣿⣿⡿⠀
#  ⠀⠀⠀⠀⠀⠀⠀⢀⠇⠀⢠⣿⣟⣭⣤⣶⣦⣄⡀⠀⠀⠈⠻⠀⠘⣿⣿⣿⠇⠀
#  ⠀⠀⠀⠀⠀⠱⠤⠊⠀⢀⣿⡿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠘⣿⠏⠀⠀                             𓆩♕𓆪
#  ⠀⠀⠀⠀⠀⡄⠀⠀⠀⠘⢧⡀⠀⠀⠸⣿⣿⣿⠟⠀⠀⠀⠀⠀⠀⠐⠋⠀⠀⠀                     𓄂 oussama ezzaou𓆃
#  ⠀⠀⠀⠀⠀⠘⠄⣀⡀⠸⠓⠀⠀⠀⠠⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀

# ===[ Import: ]===============================================================
import numpy as np


# ===[ main: ]=================================================================
def main():
    # creation using np.array() factory function
    print("===================[np.array()]==================")
    print(f"1D array:vector => {np.array([1, 2, 3])}")
    print(f"2D array:matrix =>\n{np.array([[1, 2, 3], [4, 5, 6]])}")

    print("===================[np.zeros()]==================")
    print(f"1D array: vector => {np.zeros((1, 3), dtype=np.int32)}")
    print(f"2d array: matrix =>\n {np.zeros((2, 3))}")

    print("===================[np.ones()]==================")
    print(f"1D array: vector => {np.ones((1, 3), dtype=np.int32)}")
    print(f"2d array: matrix =>\n {np.ones((2, 3))}")

    print("===================[np.full()]==================")
    print(f"1D array: vector => {np.full((1, 3), 5, dtype=np.int32)}")
    print(f"2d array: matrix =>\n {np.full((2, 3), 5)}")

    print("===================[np.empty()]==================")
    print(f"1D array: vector => {np.empty((1, 3), dtype=np.int32)}")
    print(f"2d array: matrix =>\n {np.empty((2, 3))}")

    print("===================[np.eye()]====================")
    print(f"2D array: identity matrix =>\n{np.eye(2, dtype=np.int32)}")

    print("===================[np.diag()]====================")
    print(f"2D array: diagonal matrix =>\n{np.diag([1, 2, 3])}")

    print("==================[np.arange()]===================")
    print(f"1D array: arrange matrix =>{np.arange(10)}")
    print(f"1D array: arrange matrix =>{np.arange(start=0, stop=10, step=3)}")


if __name__ == "__main__":
    main()
